hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_i2c.c
#define IS_VALID_CLK_DIV(x)                                                    \
(   ((x) == I2C_CLK_DIV1)                          ||                          \
    ((x) == I2C_CLK_DIV2)                          ||                          \
    ((x) == I2C_CLK_DIV4)                          ||                          \
    ((x) == I2C_CLK_DIV8)                          ||                          \
    ((x) == I2C_CLK_DIV16)                         ||                          \
    ((x) == I2C_CLK_DIV32)                         ||                          \
    ((x) == I2C_CLK_DIV64)                         ||                          \
    ((x) == I2C_CLK_DIV128))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup I2C_Global_Functions I2C Global Functions
 * @{
 */

/**
 * @brief  Set the baudrate for I2C peripheral.
 * @param  [in] pstcI2C_InitStruct   Pointer to I2C configuration structure
 *                                   @ref stc_i2c_init_t
 *         @arg pstcI2C_InitStruct->u32I2cClkDiv: Division of Hclk, reference as:
 *              step1: calculate div = (Hclk/Baudrate/(68+2*dnfsum+SclTime)
 *                     Hclk -- system clock
 *                     Baudrate -- baudrate of i2c
 *                     SclTime -- =(SCL rising time + SCL falling time)/period of i2cclok
 *                                according to i2c bus hardware parameter.
 *                     dnfsum -- 0 if digital filter off;
 *                               Filter capacity if digital filter on(1 ~ 4)
 *              step2: chose a division item which is similar and bigger than div
 *                     from @ref I2C_Clock_division.
 *         @arg pstcI2C_InitStruct->u32Baudrate : Baudrate configuration
 *         @arg pstcI2C_InitStruct->u32SclTime : Indicate SCL pin rising and
 *              falling time, should be number of T(i2c clock period time)
 * @param  [in] pf32Err               Baudrate error
 * @retval en_result_t
 */
en_result_t I2C_BaudrateConfig(const stc_i2c_init_t* pstcI2C_InitStruct, float32_t *pf32Err)
{
    en_result_t enRet = Ok;
    uint32_t Hclk, I2cDivClk, SclCnt, Baudrate;
    uint32_t dnfsum = 0ul, divsum = 0ul;
    float32_t WidthTotal, SumTotal;
    float32_t WidthHL;
    float32_t fErr = 0.0f;

    if ((NULL == pstcI2C_InitStruct)||(NULL == pf32Err))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_SPEED(pstcI2C_InitStruct->u32Baudrate));
        DDL_ASSERT(IS_VALID_CLK_DIV(pstcI2C_InitStruct->u32I2cClkDiv));

        /* Get configuration for i2c */
        Hclk = SystemCoreClock;
        I2cDivClk = 1ul << pstcI2C_InitStruct->u32I2cClkDiv;
        SclCnt = pstcI2C_InitStruct->u32SclTime;
        Baudrate = pstcI2C_InitStruct->u32Baudrate;

        /* Judge digital filter status*/
        if(0u != READ_REG32_BIT(M0P_I2C->FLTR, I2C_FLTR_DNFEN))
        {
            dnfsum = ((M0P_I2C->FLTR & I2C_FLTR_DNF) >> I2C_FLTR_DNF_POS) + 1u;
        }
        else
        {
            dnfsum = 0ul;
        }

        /* Judge if clock divider on*/
        if(I2C_CLK_DIV1 == I2cDivClk)
        {
            divsum = 3ul;
        }
        else
        {
            divsum = 2ul;
        }

        WidthTotal = (float32_t)Hclk/(float32_t)Baudrate/(float32_t)I2cDivClk;
        SumTotal = 2.0f*(float32_t)divsum + 2.0f*(float32_t)dnfsum + (float32_t)SclCnt;
        WidthHL = WidthTotal - SumTotal;

        if(WidthTotal <= SumTotal)
        {
            /* Err, Should set a smaller division value for pstcI2C_InitStruct->u32I2cClkDiv */
            //DDL_ASSERT(NULL);
            enRet = ErrorInvalidParameter;
        }
        else if(WidthHL > ((float32_t)0x1F*(float32_t)2))
        {
            /* Err, Should set a bigger division value for pstcI2C_InitStruct->u32I2cClkDiv */
            //DDL_ASSERT(NULL);
            enRet = ErrorInvalidParameter;
        }
        else
        {
            fErr =(WidthHL - (float32_t)((uint32_t)WidthHL)) / WidthHL;

            M0P_I2C->CCR = (pstcI2C_InitStruct->u32I2cClkDiv << I2C_CCR_CKDIV_POS)     \
                           | (((uint32_t)WidthHL/2u) << I2C_CCR_SLOWW_POS)              \
                           | (((uint32_t)WidthHL - (uint32_t)WidthHL/2u) << I2C_CCR_SHIGHW_POS);
        }
    }
    if((NULL != pf32Err)&&(Ok == enRet))
    {
        *pf32Err = fErr;
    }
    return enRet;
}

/**
 * @brief  De-initialize I2C unit
 *
 * @retval None
 */
void I2C_DeInit(void)
{
    /* Reset peripheral register and internal status*/
    bM0P_I2C->CR1_b.PE = 0u;
    bM0P_I2C->CR1_b.SWRST = 1u;
}

/**
 * @brief  Initialize I2C peripheral according to the structure
 * @param  [in] pstcI2C_InitStruct   Pointer to I2C configuration structure
 *                                   @ref stc_i2c_init_t
 *         @arg pstcI2C_InitStruct->u32I2cClkDiv: Division of Hclk, reference as:
 *              step1: calculate div = (Hclk/Baudrate/(68+2*dnfsum+SclTime)
 *                     Hclk -- system clock
 *                     Baudrate -- baudrate of i2c
 *                     SclTime -- =(SCL rising time + SCL falling time)/period of i2cclok
 *                                according to i2c bus hardware parameter.
 *                     dnfsum -- 0 if ditital filter off;
 *                               Filter capacity if ditital filter on(1 ~ 4)
 *              step2: chose a division item which is similar and bigger than div
 *                     from @ref I2C_Clock_division.
 *         @arg pstcI2C_InitStruct->u32Baudrate : Baudrate configuration
 *         @arg pstcI2C_InitStruct->u32SclTime : Indicate SCL pin rising and
 *              falling time, should be number of T(i2cclok period time)
 * @param  [in] pf32Err               Baudrate error
 * @retval en_result_t
 */
en_result_t I2C_Init(const stc_i2c_init_t* pstcI2C_InitStruct, float32_t *pf32Err)
{
    en_result_t enRet = Ok;
    if (NULL == pstcI2C_InitStruct )
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_VALID_SPEED(pstcI2C_InitStruct->u32Baudrate));
        DDL_ASSERT(IS_VALID_CLK_DIV(pstcI2C_InitStruct->u32I2cClkDiv));

        /* Register and internal status reset */
        bM0P_I2C->CR1_b.PE = 0u;
        bM0P_I2C->CR1_b.SWRST = 1u;
        bM0P_I2C->CR1_b.PE = 1u;

